# Отчет по лабораторной работе №2 по курсу "Фундументальня информатика" 
<b>Студент группы:</b> <ins>М80-108Б-22 Шелаев Серафим Ильич, номер по списку 25</ins>  
<b>Контакты e mail:</b> <ins>serafimshelaev@mail.ru</ins>  
<b>Работа выполнена:</b> «» <ins>декабря</ins> <ins>2022</ins> г.
<b>Преподаватель:</b> <ins>асп. каф. 806 Сахарин Никита Александрович</ins>

<b>Входной контроль знаний с оценкой:</b> <ins> ()</ins>

<b>Отчет сдан</b> «» <ins>декабря</ins> <ins>2022</ins> г., <b>итоговая оценка</b> <ins> ()</ins>                                                          

<b>Подпись преподавателя:</b> ________________
## 1. Тема
Обработка матриц
## 2. Цель работы
Составить программу на языке Си, производящую обработку квадратной матрицы порядка NxN (1 <= N <= 8), из целых чисел
## 3. Задание (вариант № 24)
Нахождения произведения элементов столбца с максимальным номером, содержащей минимальный элемент матрицы.
## 4. Оборудование:
ноутбук  Asus Vivobook 15(1920x1080, Intel Core i5 2.4 ГГц, RAM 16 ГБ, SSD 512 ГБ, Windows 11 Home)
## 5. Программное обеспечение:
<b>Операционная система семейства:</b> Microsoft Windows 11<br/> 
<b>Компилятор:</b> GNU Compiler Collection<br/>
<b>Текстовый редактор:</b> Visual Studio Code версия 1.73.0<br/>
## 6. Идея, метод, алгоритм решения задачи (в формах: словесной, псевдокода, графической [блок-схема, диаграмма, рисунок, таблица] или формальные спецификации с пред- и постусловиями)
Вводим матрицу, затем обрабатываем ее элементы.Находим минимальный элемент матрицы и соответствующий ему максимальный номер столбца.А затем призведение элементов столбца.   
 
## 7. Сценарий выполнения работы [план работы, первоначальный текст программы в черновике (можно на отдельном листе) и тесты либо соображения по тестированию]. 
Тесты:
```
1
```
```
1 2
3 4
```
```
1 2 3
4 5 6
7 1 2
```
```
4 5 6 3
1 2 1 1
4 3 2 8
2 1 2 2
```
```
#include <stdio.h>

#define N (7)


void matrix_print(size_t n, int (*mat)[n]) {


    int elem_min = mat[0][0];
    int max_j = 0;
    for(int i = 0;i < n; i++) {
        for(int j = 0 ;j < n; j++) {
            if(elem_min > mat[i][j]) {
                elem_min = mat[i][j];
                max_j = j;
            } else 
                if(elem_min == mat[i][j]) {
                    if(j > max_j) {
                        max_j = j;
                    }   

                }


        }
    
    }
    int proizv = 1;
    for(int i = 0;i < n; i++) {
        proizv = proizv*mat[i][max_j]; 
    }
    printf("%d ",proizv);



}

 






void matrix_input(size_t n, int (*mat)[n]) {
    for (int i = 0; i < n; ++i) {
        for (int j = 0; j < n; ++j) {
            scanf("%d", &mat[i][j]);
        }
    }
}


int main(void) {
    size_t n;
    scanf("%zu", &n);
    int mat[N * N];
    matrix_input(n, (int (*)[n]) mat);
    matrix_print(n, (int (*)[n]) mat);
    return 0;
}

  
```



Пункты 1-7 отчета составляются сторого до начала лабораторной работы.
Допущен к выполнению работы.  
<b>Подпись преподавателя</b> ________________
## 8. Распечатка протокола 
```
```
## 9. Дневник отладки должен содержать дату и время сеансов отладки и основные события (ошибки в сценарии и программе, нестандартные ситуации) и краткие комментарии к ним. В дневнике отладки приводятся сведения об использовании других ЭВМ, существенном участии преподавателя и других лиц в написании и отладке программы.

| № |  Лаб. или дом. | Дата | Время | Событие | Действие по исправлению | Примечание |
| ------ | ------ | ------ | ------ | ------ | ------ | ------ |
| 1 | дом. | 01.10.22 | 13:00 | Выполнение лабораторной работы | - | - |
## 10. Замечания автора по существу работы — Написание команд для отработки навыков работы в ОС UNIX.
```
```
## 11. Выводы
Была написана программа на языке на Си, выполняющая указанное вариантом действие над квадратной матрицей. В результате выполнения работы, были приобретены навыки для работы с квадратными матрицами и обработки их элементов.  
Недочёты при выполнении задания могут быть устранены следующим образом: —

<b>Подпись студента:</b> ____________________




