# Отчет по лабораторной работе №2 по курсу "Фундументальня информатика" 
<b>Студент группы:</b> <ins>М80-108Б-22 Шелаев Серафим Ильич, номер по списку 25</ins>  
<b>Контакты e mail:</b> <ins>serafimshelaev@mail.ru</ins>  
<b>Работа выполнена:</b> «» <ins>декабря</ins> <ins>2022</ins> г.
<b>Преподаватель:</b> <ins>асп. каф. 806 Сахарин Никита Александрович</ins>

<b>Входной контроль знаний с оценкой:</b> <ins> ()</ins>

<b>Отчет сдан</b> «» <ins>декабря</ins> <ins>2022</ins> г., <b>итоговая оценка</b> <ins> ()</ins>                                                          

<b>Подпись преподавателя:</b> ________________
## 1. Тема
Вложенные циклы с параметрами. Обход и линеаризация матриц.  
## 2. Цель работы
Составить программу ввода квадратной матрицы и печати в строку всех её элементов в заданном ниже порядке следования (обхода) с помощью вложенных циклов с переменными границами.  
## 3. Задание (вариант № 24)
```
4 5  6  7
3 14 15 8
2 13 16 9
1 12 11 10
```
## 4. Оборудование:
ноутбук  Asus Vivobook 15(1920x1080, Intel Core i5 2.4 ГГц, RAM 16 ГБ, SSD 512 ГБ, Windows 11 Home)
## 5. Программное обеспечение:
<b>Операционная система семейства:</b> Microsoft Windows 11<br/> 
<b>Компилятор:</b> GNU Compiler Collection<br/>
<b>Текстовый редактор:</b> Visual Studio Code версия 1.73.0<br/>
## 6. Идея, метод, алгоритм решения задачи (в формах: словесной, псевдокода, графической [блок-схема, диаграмма, рисунок, таблица] или формальные спецификации с пред- и постусловиями)
Вводим размеры матрицы, затем элементы. Обрабатываем элементы матрицы в нужном порядке.

 
## 7. Сценарий выполнения работы [план работы, первоначальный текст программы в черновике (можно на отдельном листе) и тесты либо соображения по тестированию]. 
Тесты:
```
1
```
```
11 12
21 22
```
```
11 12 13
21 22 23
31 32 33
```
```
11 12 13 14
21 22 23 24
31 32 33 34
41 42 43 44
```

```
#include <stdio.h>

#define N (7)

enum State {
    up,
    down,
    right,
    left
};

void matrix_print(size_t n, int (*mat)[n]) {



    enum State state=up;
        int v[4] = {0, 1, 0, -1};
        int k=n;
        int a = k;
        int p = 0;
        int i = n, j = 0;
        while(a != 0){
            for(int x = 0; x != a; x++ ) {
                j = j + v[p%4];
                i = i + v[(p+3)%4];
                printf("%d ", mat[i][j]);
            }
            p++;
            a = a - p%2;


   
     
        }
}
 






void matrix_input(size_t n, int (*mat)[n]) {
    for (int i = 0; i < n; ++i) {
        for (int j = 0; j < n; ++j) {
            scanf("%d", &mat[i][j]);
        }
    }
}


int main(void) {
    size_t n;
    scanf("%zu", &n);
    int mat[N * N];
    matrix_input(n, (int (*)[n]) mat);
    matrix_print(n, (int (*)[n]) mat);
    return 0;
}
```



Пункты 1-7 отчета составляются сторого до начала лабораторной работы.
Допущен к выполнению работы.  
<b>Подпись преподавателя</b> ________________
## 8. Распечатка протокола 
```
```
## 9. Дневник отладки должен содержать дату и время сеансов отладки и основные события (ошибки в сценарии и программе, нестандартные ситуации) и краткие комментарии к ним. В дневнике отладки приводятся сведения об использовании других ЭВМ, существенном участии преподавателя и других лиц в написании и отладке программы.

| № |  Лаб. или дом. | Дата | Время | Событие | Действие по исправлению | Примечание |
| ------ | ------ | ------ | ------ | ------ | ------ | ------ |
| 1 | дом. | 01.10.22 | 13:00 | Выполнение лабораторной работы | - | - |
## 10. Замечания автора по существу работы — Написание команд для отработки навыков работы в ОС UNIX.
```
```
## 11. Выводы
Была написана программа на языке на Си, выполняющая указанное вариантом действие над квадратной матрицей. В результате выполнения работы, были приобретены навыки для работы с квадратными матрицами и печати в строку всех их элементов.  
Недочёты при выполнении задания могут быть устранены следующим образом: —

<b>Подпись студента:</b> ____________________




