# Отчет по лабораторной работе №2 по курсу "Фундументальня информатика" 
<b>Студент группы:</b> <ins>М80-108Б-22 Шелаев Серафим Ильич, номер по списку 25</ins>  
<b>Контакты e mail:</b> <ins>serafimshelaev@mail.ru</ins>  
<b>Работа выполнена:</b> «» <ins>декабря</ins> <ins>2022</ins> г.
<b>Преподаватель:</b> <ins>асп. каф. 806 Сахарин Никита Александрович</ins>

<b>Входной контроль знаний с оценкой:</b> <ins> ()</ins>

<b>Отчет сдан</b> «» <ins>декабря</ins> <ins>2022</ins> г., <b>итоговая оценка</b> <ins> ()</ins>                                                          

<b>Подпись преподавателя:</b> ________________
## 1. Тема
Техника работы с целыми числами. Системы счисления.  
## 2. Цель работы
Составить программу на языке Си в целом типе данных, которая для любых допустимых и корректно записанных чисел этого типа в десятичном изображении, поступающих на стандартный ввод программы, выполняет указанное вариантом действие над их значениями.  
## 3. Задание (вариант № 26)
После каждых двух цифр вставитьих сумму если она также является суммой.  
## 4. Оборудование:
ноутбук  Asus Vivobook 15(1920x1080, Intel Core i5 2.4 ГГц, RAM 16 ГБ, SSD 512 ГБ, Windows 11 Home)
## 5. Программное обеспечение:
<b>Операционная система семейства:</b> Microsoft Windows 11<br/> 
<b>Компилятор:</b> GNU Compiler Collection<br/>
<b>Текстовый редактор:</b> Visual Studio Code версия 1.73.0<br/>
## 6. Идея, метод, алгоритм решения задачи (в формах: словесной, псевдокода, графической [блок-схема, диаграмма, рисунок, таблица] или формальные спецификации с пред- и постусловиями)
Считаем сумму двух цифр и взависимости от их суммы выводим либо просто эти две цифры либо двецифры и их сумму.  

 
## 7. Сценарий выполнения работы [план работы, первоначальный текст программы в черновике (можно на отдельном листе) и тесты либо соображения по тестированию]. 
Тесты:
10 11 12 22 23 33 34 44  
5  
11 22 34 78 10  
1123895  

```
#include <stdio.h>
#include <stdlib.h>

enum State {
    INSIDE,
    OUTSIDE
};

int f_1();


int main(void) {
    f_1();

    return 0;
}

int f_1() {
    enum State state = INSIDE;
    char c;
   
    int i = 0;

    int sum = 0;
    int now=0;
    int now_1=0;
    int now_2=0;
   
    for(char c=getchar() ;c!='\n'; c=getchar()) {
      
        if(c!=' ') {
            switch (state) {
                case INSIDE:
                    now_1=c-'0';
                    sum=sum*10+now_1;
                    now=now + now_1;
                    state=OUTSIDE;
                    break;
                case OUTSIDE:
                    now_2=c-'0';
                    sum=sum*10+now_2;
                    now=now + now_2;
                    if(now<10) {
                        sum=sum*10+now;
                        printf("%d",sum);
                        now=0;
                        sum=0;
                    } else {
                        printf("%d",sum);
                        now=0;
                        sum=0;
                      }
                    state= INSIDE;
                    break;
                
                
            }
       } else { 
            if(sum>0) { 
                printf("%d",sum); state =INSIDE;
            }
            printf(" ");
            sum=0;
            now=0;
        
         }
       
       
   }
   if(sum>0) {
    printf("%d",sum);
   }
       
   
    
}
```



Пункты 1-7 отчета составляются сторого до начала лабораторной работы.
Допущен к выполнению работы.  
<b>Подпись преподавателя</b> ________________
## 8. Распечатка протокола 
```
```
## 9. Дневник отладки должен содержать дату и время сеансов отладки и основные события (ошибки в сценарии и программе, нестандартные ситуации) и краткие комментарии к ним. В дневнике отладки приводятся сведения об использовании других ЭВМ, существенном участии преподавателя и других лиц в написании и отладке программы.

| № |  Лаб. или дом. | Дата | Время | Событие | Действие по исправлению | Примечание |
| ------ | ------ | ------ | ------ | ------ | ------ | ------ |
| 1 | дом. | 01.10.22 | 13:00 | Выполнение лабораторной работы | - | - |
## 10. Замечания автора по существу работы — Написание команд для отработки навыков работы в ОС UNIX.
```
```
## 11. Выводы
Была написана программа на языке на Си, выполняющая указанное вариантом действие над значениями в целом типе данных. В результате выполнения работы, были приобретены навыки для работы с числами в целом типе данных.  
Недочёты при выполнении задания могут быть устранены следующим образом: —

<b>Подпись студента:</b> ____________________




