# Отчет по лабораторной работе №21 по курсу "Фундументальня информатика" 
<b>Студент группы:</b> <ins>М80-108Б-22 Шелаев Серафим Ильич, номер по списку 23</ins>  
<b>Контакты e mail:</b> <ins>serafimshelaev@mail.ru</ins>  
<b>Работа выполнена:</b> «29» <ins>b.yz</ins> <ins>2023</ins> г.
<b>Преподаватель:</b> <ins>асп. каф. 806 Сахарин Никита Александрович</ins>

<b>Входной контроль знаний с оценкой:</b> <ins>3 (удовлетворительно)</ins>

<b>Отчет сдан</b> «29» <ins>июня</ins> <ins>2022</ins> г., <b>итоговая оценка</b>3 <ins> (удовлетворительно)</ins>                                                          

<b>Подпись преподавателя:</b> ________________
## 1. Тема
Программирование на интерпретируемых командных языках
## 2. Цель работы
Составить программу выполнения заданных действий над файлами на одном из интерпретируемом командном языке ОС UNIX - Bash
## 3. Задание (вариант № 23)
Поиск и удаление максимального элемента в стека, с помощьюсортировки линейным выбором  
## 4. Оборудование:
ноутбук  Asus Vivobook 15(1920x1080, Intel Core i5 2.4 ГГц, RAM 16 ГБ, SSD 512 ГБ, Windows 11 Home)
## 5. Программное обеспечение:
<b>Операционная система семейства:</b> Microsoft Windows 11<br/> 
<b>Компилятор:</b> GNU Compiler Collection<br/>
<b>Текстовый редактор:</b> Visual Studio Code версия 1.73.0<br/>
## 6. Идея, метод, алгоритм решения задачи (в формах: словесной, псевдокода, графической [блок-схема, диаграмма, рисунок, таблица] или формальные спецификации с пред- и постусловиями)
Рекурсивно обходятся папка и поддиректории и обновляется значение количества файлов   
## 7. Сценарий выполнения работы [план работы, первоначальный текст программы в черновике (можно на отдельном листе) и тесты либо соображения по тестированию]. 
```
#рекурсивный обход и посчет числа выполнимых файлов в каталоге и поддиректориях
import os
k=0
path='C:\\Users\\seraf\\OneDrive\\Рабочий стол\\lab21'
def FileCrowling(path,k):
    for i in os.listdir(path):
        if os.path.isfile(path+'\\'+i):
            k=k+1
        if os.path.isdir(path+'\\'+i):
            return FileCrowling(path+'\\'+i,k)
    return k
        
print(FileCrowling(path,0))
```

## 8. Протокол  


## 9. Дневник отладки должен содержать дату и время сеансов отладки и основные события (ошибки в сценарии и программе, нестандартные ситуации) и краткие комментарии к ним. В дневнике отладки приводятся сведения об использовании других ЭВМ, существенном участии преподавателя и других лиц в написании и отладке программы.

| № |  Лаб. или дом. | Дата | Время | Событие | Действие по исправлению | Примечание |
| ------ | ------ | ------ | ------ | ------ | ------ | ------ |
| 1 | дом. | 27.05.22 | 13:00 | Выполнение лабораторной работы | - | - |
## 10. Замечания автора по существу работы — Написание команд для отработки навыков работы в ОС UNIX.
Защита с Coderforces:  
<b>[Контест (Div. 2)](https://codeforces.com/contest/1810/submission/199989384)</b>  

## 11. Выводы
Благодаря лабораторной работе были получениы базовые навыки написания Bash-скриптов. Был изучен синтаксис языка Bash. 
Недочёты при выполнении задания могут быть устранены следующим образом: —

<b>Подпись студента:</b> ____________________



